---
type: SplitButton
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# SplitButton

`Autodesk.Revit.UI.SplitButton` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CurrentButton | 2011 | `public PushButton CurrentButton { get ; set ; }` |
| Property | IsSynchronizedWithCurrentItem | 2011 | `public bool IsSynchronizedWithCurrentItem { get ; set ; }` |